Конфигурация/InformationRegisters/ДатыЗапретаРедактирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаРедактирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапретаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаЗапрета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыЗапретаРедактирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ГруппыЗапретаРедактирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ГруппыЗапретаРедактирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БэкОфис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Партии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проводки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/ДатыЗапретаРедактирования/Ext/ManagerModule.bsl
//	Функция возвращает пустую таблицу значений для заполнения с целью последующей передачи ее методу "ПроверитьКорректностьДатЗапретаРедактирования".
Функция ПолучитьСтруктуруТаблицыЗначенийДляПроверки() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Организация",					Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("СчетДоверительногоУправления",	Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	Результат.Колонки.Добавить("ВидУчета",						Новый ОписаниеТипов("ПеречислениеСсылка.ВидыУчета"));
	Результат.Колонки.Добавить("ГруппаЗапрета",					Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыЗапретаРедактирования"));
	Результат.Колонки.Добавить("ДатаЗапретаРедактирования",		Новый ОписаниеТипов("Дата"));
	
	Возврат Результат;
	
КонецФункции

//	Функция проверяет правильность заполнения вида учета по группе запрета, а также согласованность дат запрета группам запрета 'Бэк-офис', 'Партии' и 'Проводки'.
//	Параметры:
//	Организация - организация, в рамках которой меняются даты запрета редактиврования;
//	Данные - Таблица значений с колонками СчетДоверительногоУправления, ВидУчета, ГруппаЗапрета и Дата.
//		Данная таблица содержит только изменяемые записи.
//		Данные, которые не меняются, функция возьмет из регистра.
Функция ПроверитьКорректностьДатЗапретаРедактирования(Организация, Данные) Экспорт
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ЗаписываемыеДанные",	Данные);
	
	РегистрыСведений.ДатыЗапретаРедактирования.ПоместитьВЗапросДатыЗапретаРедактированияКонтролера(Запрос);
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаписываемыеДанные.Организация КАК Организация,
		|	ЗаписываемыеДанные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗаписываемыеДанные.ВидУчета КАК ВидУчета,
		|	ЗаписываемыеДанные.ГруппаЗапрета КАК ГруппаЗапрета,
		|	ЗаписываемыеДанные.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
		|ПОМЕСТИТЬ _ЗаписываемыеДаные
		|ИЗ
		|	&ЗаписываемыеДанные КАК ЗаписываемыеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.ГруппаЗапрета КАК ГруппаЗапрета,
		|	ВложенныйЗапрос.ВидУчета КАК ВидУчета,
		|	ВложенныйЗапрос.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования,
		|	ЛицензииДоговоровДоверительногоУправления.Лицензия.ВидДеятельности КАК ВидДеятельности
		|ПОМЕСТИТЬ _ДатыЗапретаРедактированияСВидамиДеятельности
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДатыЗапретаРедактирования.Организация КАК Организация,
		|		_ДатыЗапретаРедактирования.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ДатыЗапретаРедактирования.ГруппаЗапрета КАК ГруппаЗапрета,
		|		_ДатыЗапретаРедактирования.ВидУчета КАК ВидУчета,
		|		_ДатыЗапретаРедактирования.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования,
		|		ЛицензииДоговоровДоверительногоУправления.Лицензия.ВидДеятельности КАК ВидДеятельности,
		|		МАКСИМУМ(ЛицензииДоговоровДоверительногоУправления.Период) КАК Период
		|	ИЗ
		|		_ЗаписываемыеДаные КАК _ДатыЗапретаРедактирования
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ЛицензииДоговоровДоверительногоУправления
		|			ПО _ДатыЗапретаРедактирования.Организация = ЛицензииДоговоровДоверительногоУправления.Организация
		|				И _ДатыЗапретаРедактирования.СчетДоверительногоУправления = ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления
		|				И _ДатыЗапретаРедактирования.ДатаЗапретаРедактирования >= ЛицензииДоговоровДоверительногоУправления.Период
		|	ГДЕ
		|		_ДатыЗапретаРедактирования.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.БэкОфис)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ДатыЗапретаРедактирования.Организация,
		|		_ДатыЗапретаРедактирования.СчетДоверительногоУправления,
		|		_ДатыЗапретаРедактирования.ГруппаЗапрета,
		|		_ДатыЗапретаРедактирования.ВидУчета,
		|		_ДатыЗапретаРедактирования.ДатаЗапретаРедактирования,
		|		ЛицензииДоговоровДоверительногоУправления.Лицензия.ВидДеятельности) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ЛицензииДоговоровДоверительногоУправления
		|		ПО ВложенныйЗапрос.Организация = ЛицензииДоговоровДоверительногоУправления.Организация
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.ВидДеятельности = ЛицензииДоговоровДоверительногоУправления.Лицензия.ВидДеятельности
		|			И ВложенныйЗапрос.Период = ЛицензииДоговоровДоверительногоУправления.Период
		|ГДЕ
		|	ЛицензииДоговоровДоверительногоУправления.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыЗапретаРедактирования.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДатыЗапретаРедактирования.ВидУчета КАК ВидУчета,
		|	ДатыЗапретаРедактирования.ГруппаЗапрета КАК ГруппаЗапрета,
		|	ДатыЗапретаРедактирования.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
		|ПОМЕСТИТЬ _ДатыЗапрета
		|ИЗ
		|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
		|ГДЕ
		|	ДатыЗапретаРедактирования.Организация = &Организация
		|	И ДатыЗапретаРедактирования.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_ЗаписываемыеДаные.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|			ИЗ
		|				_ЗаписываемыеДаные КАК _ЗаписываемыеДаные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыЗапрета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДатыЗапрета.ВидУчета КАК ВидУчета,
		|	_ДатыЗапрета.ГруппаЗапрета КАК ГруппаЗапрета,
		|	ЕСТЬNULL(_ЗаписываемыеДаные.ДатаЗапретаРедактирования, _ДатыЗапрета.ДатаЗапретаРедактирования) КАК ДатаЗапретаРедактирования
		|ПОМЕСТИТЬ _НовоеСостояние
		|ИЗ
		|	_ДатыЗапрета КАК _ДатыЗапрета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗаписываемыеДаные КАК _ЗаписываемыеДаные
		|		ПО _ДатыЗапрета.СчетДоверительногоУправления = _ЗаписываемыеДаные.СчетДоверительногоУправления
		|			И _ДатыЗапрета.ВидУчета = _ЗаписываемыеДаные.ВидУчета
		|			И _ДатыЗапрета.ГруппаЗапрета = _ЗаписываемыеДаные.ГруппаЗапрета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НовоеСостояние.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НовоеСостояние.ВидУчета КАК ВидУчета,
		|	_НовоеСостояние.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
		|ПОМЕСТИТЬ _БэкОфис
		|ИЗ
		|	_НовоеСостояние КАК _НовоеСостояние
		|ГДЕ
		|	_НовоеСостояние.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.БэкОфис)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НовоеСостояние.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НовоеСостояние.ВидУчета КАК ВидУчета,
		|	_НовоеСостояние.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
		|ПОМЕСТИТЬ _Партии
		|ИЗ
		|	_НовоеСостояние КАК _НовоеСостояние
		|ГДЕ
		|	_НовоеСостояние.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НовоеСостояние.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НовоеСостояние.ВидУчета КАК ВидУчета,
		|	_НовоеСостояние.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
		|ПОМЕСТИТЬ _Проводки
		|ИЗ
		|	_НовоеСостояние КАК _НовоеСостояние
		|ГДЕ
		|	_НовоеСостояние.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Проводки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	""При выбранной группе запрета 'Бэк-офис' вид учета не должен заполняться!"" КАК Текст,
		|	NULL КАК ГруппаЗапрета
		|ПОМЕСТИТЬ _ОшибкиЗаполнения
		|ИЗ
		|	_ЗаписываемыеДаные КАК _ЗаписываемыеДаные
		|ГДЕ
		|	_ЗаписываемыеДаные.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.БэкОфис)
		|	И _ЗаписываемыеДаные.ВидУчета <> ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""При выбранной группе запрета редактирования '&ГруппаЗапрета' вид учета должен быть заполнен!"",
		|	_ЗаписываемыеДаные.ГруппаЗапрета
		|ИЗ
		|	_ЗаписываемыеДаные КАК _ЗаписываемыеДаные
		|ГДЕ
		|	_ЗаписываемыеДаные.ГруппаЗапрета <> ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.БэкОфис)
		|	И _ЗаписываемыеДаные.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Партии.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	NULL КАК ВидУчета,
		|	_БэкОфис.ДатаЗапретаРедактирования КАК ДатаЗапрета1,
		|	_Партии.ДатаЗапретаРедактирования КАК ДатаЗапрета2,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_БэкОфис.ДатаЗапретаРедактирования, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ""По счету д/у '&СДУ' отсутствует дата запрета редактирования операций бэк-офиса!""
		|		ИНАЧЕ ""По счету д/у '&СДУ' дата запрета редактирования операций бэк-офиса меньше, чем дата запрета редактирования партий!""
		|	КОНЕЦ КАК Текст
		|ПОМЕСТИТЬ _ОшибкиСогласованости
		|ИЗ
		|	_Партии КАК _Партии
		|		ЛЕВОЕ СОЕДИНЕНИЕ _БэкОфис КАК _БэкОфис
		|		ПО _Партии.СчетДоверительногоУправления = _БэкОфис.СчетДоверительногоУправления
		|ГДЕ
		|	_Партии.ДатаЗапретаРедактирования > ЕСТЬNULL(_БэкОфис.ДатаЗапретаРедактирования, ДАТАВРЕМЯ(1, 1, 1))
		|	И _Партии.ДатаЗапретаРедактирования > ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_Проводки.СчетДоверительногоУправления,
		|	_Проводки.ВидУчета,
		|	_Партии.ДатаЗапретаРедактирования,
		|	_Проводки.ДатаЗапретаРедактирования,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_Партии.ДатаЗапретаРедактирования, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ""По счету д/у '&СДУ' отсутствует дата запрета редактирования партий по виду учета '&ВидУчета'!""
		|		ИНАЧЕ ""По счету д/у '&СДУ' дата запрета редактирования партий по виду учета '&ВидУчета' меньше, чем дата запрета редактирования проводок!""
		|	КОНЕЦ
		|ИЗ
		|	_Проводки КАК _Проводки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Партии КАК _Партии
		|		ПО _Проводки.СчетДоверительногоУправления = _Партии.СчетДоверительногоУправления
		|			И _Проводки.ВидУчета = _Партии.ВидУчета
		|ГДЕ
		|	_Проводки.ДатаЗапретаРедактирования > ЕСТЬNULL(_Партии.ДатаЗапретаРедактирования, ДАТАВРЕМЯ(1, 1, 1))
		|	И _Проводки.ДатаЗапретаРедактирования > ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ДатыЗапретаРедактированияСВидамиДеятельности.СчетДоверительногоУправления,
		|	"""",
		|	_ДатыЗапретаРедактированияСВидамиДеятельности.ДатаЗапретаРедактирования,
		|	_ДатыЗапретаРедактированияКонтролера.ДатаЗапретаРедактирования,
		|	""По счету д/у '&СДУ' дата запрета редактирования операций бэк-офиса (&ДатаЗапрета1) меньше, чем дата запрета редактирования контролёра (&ДатаЗапрета2)""
		|ИЗ
		|	_ДатыЗапретаРедактированияКонтролера КАК _ДатыЗапретаРедактированияКонтролера
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыЗапретаРедактированияСВидамиДеятельности КАК _ДатыЗапретаРедактированияСВидамиДеятельности
		|		ПО _ДатыЗапретаРедактированияКонтролера.Организация = _ДатыЗапретаРедактированияСВидамиДеятельности.Организация
		|			И _ДатыЗапретаРедактированияКонтролера.ВидДеятельности = _ДатыЗапретаРедактированияСВидамиДеятельности.ВидДеятельности
		|			И _ДатыЗапретаРедактированияКонтролера.ДатаЗапретаРедактирования > _ДатыЗапретаРедактированияСВидамиДеятельности.ДатаЗапретаРедактирования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ДатыЗапретаРедактирования.СчетДоверительногоУправления,
		|	"""",
		|	_ДатыЗапретаРедактированияКонтролера.ДатаЗапретаРедактирования,
		|	_ДатыЗапретаРедактирования.ДатаЗапретаРедактирования,
		|	""По счету д/у '&СДУ' дата запрета редактирования операций бэк-офиса (&ДатаЗапрета1) меньше, чем дата запрета редактирования контролёра (&ДатаЗапрета2)""
		|ИЗ
		|	_ДатыЗапретаРедактированияКонтролера КАК _ДатыЗапретаРедактированияКонтролера
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗаписываемыеДаные КАК _ДатыЗапретаРедактирования
		|		ПО _ДатыЗапретаРедактированияКонтролера.Организация = _ДатыЗапретаРедактирования.Организация
		|			И (_ДатыЗапретаРедактирования.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.БэкОфис))
		|			И _ДатыЗапретаРедактированияКонтролера.ДатаЗапретаРедактирования > _ДатыЗапретаРедактирования.ДатаЗапретаРедактирования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ЛицензииДоговоровДоверительногоУправления
		|		ПО (_ДатыЗапретаРедактирования.Организация = ЛицензииДоговоровДоверительногоУправления.Организация)
		|			И (_ДатыЗапретаРедактирования.СчетДоверительногоУправления = ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления)
		|			И _ДатыЗапретаРедактированияКонтролера.ВидДеятельности = ЛицензииДоговоровДоверительногоУправления.Лицензия.ВидДеятельности
		|			И (ЛицензииДоговоровДоверительногоУправления.Период МЕЖДУ _ДатыЗапретаРедактирования.ДатаЗапретаРедактирования И _ДатыЗапретаРедактированияКонтролера.ДатаЗапретаРедактирования)
		|			И (ЛицензииДоговоровДоверительногоУправления.Действует)";
	#КонецОбласти
	
	Запрос.Выполнить();
	
	ОшибкиЗаполнения = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ОшибкиЗаполнения").ПолучитьДанные().Выгрузить();
	
	Если ОшибкиЗаполнения.Количество() > 0 Тогда
		
		Результат = Ложь;
		
		Для Каждого Ошибка Из ОшибкиЗаполнения Цикл
			Текст = СтрЗаменить(Ошибка.Текст, "&ГруппаЗапрета", Строка(Ошибка.ГруппаЗапрета));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		КонецЦикла;
		
	Иначе
		
		ОшибкиСогласованости = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ОшибкиСогласованости").ПолучитьДанные().Выгрузить();
		
		Если ОшибкиСогласованости.Количество() > 0 Тогда
			
			Результат = Ложь;
			
			Для Каждого Ошибка Из ОшибкиСогласованости Цикл
				
				Текст = Ошибка.Текст;
				
				Текст = СтрЗаменить(Текст, "&ВидУчета",		Строка(Ошибка.ВидУчета));
				Текст = СтрЗаменить(Текст, "&СДУ", 			Строка(Ошибка.СчетДоверительногоУправления));
				Текст = СтрЗаменить(Текст, "&ДатаЗапрета1",	Формат(Ошибка.ДатаЗапрета1, "ДФ=dd.MM.yyyy"));
				Текст = СтрЗаменить(Текст, "&ДатаЗапрета2",	Формат(Ошибка.ДатаЗапрета2, "ДФ=dd.MM.yyyy"));

				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьТаблицуПроверкиДатЗапретаРедактирования() Экспорт
	
	МетаРегистр = Метаданные.РегистрыСведений.ДатыЗапретаРедактирования;	
	
	ТаблицаПроверки = Новый ТаблицаЗначений;
	ТаблицаПроверки.Колонки.Добавить("ГруппаЗапрета",					МетаРегистр.Измерения.ГруппаЗапрета.Тип);
	ТаблицаПроверки.Колонки.Добавить("ВидУчета",						МетаРегистр.Измерения.ВидУчета.Тип);
	ТаблицаПроверки.Колонки.Добавить("Организация",						МетаРегистр.Измерения.Организация.Тип);
	ТаблицаПроверки.Колонки.Добавить("СчетДоверительногоУправления",	МетаРегистр.Измерения.СчетДоверительногоУправления.Тип);
	ТаблицаПроверки.Колонки.Добавить("Период",							МетаРегистр.Ресурсы.ДатаЗапретаРедактирования.Тип);
	
	Возврат ТаблицаПроверки;
	
КонецФункции

Функция ДобавитьСтрокуВТаблицуПроверкиДатЗапретаРедактирования(ТаблицаПроверкиЗапретаРедактирования, ГруппаЗапрета, ВидУчета = Неопределено, Организация, СчетДоверительногоУправления, Период) Экспорт
	
	НоваяСтрока = ТаблицаПроверкиЗапретаРедактирования.Добавить();
	НоваяСтрока.ГруппаЗапрета					= ГруппаЗапрета;
	НоваяСтрока.ВидУчета						= ВидУчета;
	НоваяСтрока.Организация						= Организация;
	НоваяСтрока.СчетДоверительногоУправления	= СчетДоверительногоУправления;
	НоваяСтрока.Период							= Период;
	
	Возврат НоваяСтрока;
	
КонецФункции

Процедура ПоместитьВЗапросДатыЗапретаРедактированияКонтролера(Запрос, ИгнорироватьДатуЗапретаРедактированияКонтролера = Ложь) Экспорт
	
	ДатыЗапретаРедактированияКонтролера = Новый ТаблицаЗначений;
	ДатыЗапретаРедактированияКонтролера.Колонки.Добавить("Организация",					Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ДатыЗапретаРедактированияКонтролера.Колонки.Добавить("ВидДеятельности",				Новый ОписаниеТипов("СправочникСсылка.ВидыДеятельности"));
	ДатыЗапретаРедактированияКонтролера.Колонки.Добавить("ДатаЗапретаРедактирования",	Новый ОписаниеТипов("Дата"));
	
	Если НЕ ИгнорироватьДатуЗапретаРедактированияКонтролера Тогда
	
#Область Задача_186985

		НоваяДатаЗапретаРедактированияКонтролера = ДатыЗапретаРедактированияКонтролера.Добавить();
		НоваяДатаЗапретаРедактированияКонтролера.Организация				= ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ");
		НоваяДатаЗапретаРедактированияКонтролера.ВидДеятельности			= Справочники.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами;
		НоваяДатаЗапретаРедактированияКонтролера.ДатаЗапретаРедактирования	= Дата(2023, 5, 31);
		
		НоваяДатаЗапретаРедактированияКонтролера = ДатыЗапретаРедактированияКонтролера.Добавить();
		НоваяДатаЗапретаРедактированияКонтролера.Организация				= ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ");
		НоваяДатаЗапретаРедактированияКонтролера.ВидДеятельности			= Справочники.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами;
		НоваяДатаЗапретаРедактированияКонтролера.ДатаЗапретаРедактирования	= Дата(2023, 5, 31);

#КонецОбласти

	КонецЕсли;

	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ДатыЗапретаРедактированияКонтролера, "_ДатыЗапретаРедактированияКонтролера", Запрос);
	
КонецПроцедуры




#Область Функции_для_временного_снятия_дат_запрета

Функция СформироватьСтруктуруОтбораДатЗапрета(Организация, СчетДоверительногоУправления, ГруппаЗапрета = Неопределено, ВидУчета = Неопределено) Экспорт
	
	ОтборДатЗапрета = Новый Структура("Организация, СчетДоверительногоУправления", Организация, СчетДоверительногоУправления);
	
	Если ГруппаЗапрета <> Неопределено Тогда
		ОтборДатЗапрета.Вставить("ГруппаЗапрета", ГруппаЗапрета);
	КонецЕсли;
	
	Если ВидУчета <> Неопределено Тогда
		ОтборДатЗапрета.Вставить("ВидУчета", ВидУчета);
	КонецЕсли;	
	
	Возврат ОтборДатЗапрета;
	
КонецФункции

Функция СоздатьНаборЗаписейСОтбором(Отбор)
	
	НаборЗаписейДатЗапретаРедактирования = РегистрыСведений.ДатыЗапретаРедактирования.СоздатьНаборЗаписей();
	
	НаборЗаписейДатЗапретаРедактирования.Отбор.Организация.Установить(Отбор.Организация);
	НаборЗаписейДатЗапретаРедактирования.Отбор.СчетДоверительногоУправления.Установить(Отбор.СчетДоверительногоУправления);
	
	Если Отбор.Свойство("ГруппаЗапрета") Тогда
		НаборЗаписейДатЗапретаРедактирования.Отбор.ГруппаЗапрета.Установить(Отбор.ГруппаЗапрета);
	КонецЕсли;
	
	Если Отбор.Свойство("ВидУчета") Тогда
		НаборЗаписейДатЗапретаРедактирования.Отбор.ВидУчета.Установить(Отбор.ВидУчета);
	КонецЕсли;
	
	Возврат НаборЗаписейДатЗапретаРедактирования;
	
КонецФункции

Процедура ОчиститьДатыЗапретаРедактирования(Отбор) Экспорт
	
	НаборЗаписейДатЗапретаРедактирования = СоздатьНаборЗаписейСОтбором(Отбор);	
	НаборЗаписейДатЗапретаРедактирования.ДополнительныеСвойства.Вставить("ИгнорироватьДатуЗапретаРедактированияКонтролера");
	НаборЗаписейДатЗапретаРедактирования.Записать();

КонецПроцедуры

Функция ПолучитьДатыЗапретаРедактирования(Отбор, УдалитьПолученные = Ложь) Экспорт
	
	НаборЗаписейДатЗапретаРедактирования = СоздатьНаборЗаписейСОтбором(Отбор);	
	НаборЗаписейДатЗапретаРедактирования.Прочитать();
	
	УстановленныеДатыЗапрета = НаборЗаписейДатЗапретаРедактирования.Выгрузить();
	
	Если УдалитьПолученные Тогда
		НаборЗаписейДатЗапретаРедактирования.Очистить();
		НаборЗаписейДатЗапретаРедактирования.Записать();
	КонецЕсли;
	
	Возврат УстановленныеДатыЗапрета;

КонецФункции

// Проверяет наличие установленного запрета редактирования
//
// Параметры:
//	Период								- Дата				- период 
//	СведенияОДатахЗапретаРедактирования	- ТаблицаЗначений	- даты запрета редактирования
//										- Структура			- параметры получения дат запрета редактирования (см. СформироватьСтруктуруОтбораДатЗапрета)
// Возвращаемое значение:
//	ЗапретРедактирования - Булево - Истина, если стоит запрет редактирования 
//
Функция ПроверитьЗапретРедактирования(Период, СведенияОДатахЗапретаРедактирования) Экспорт
	
	РезультатФункции = Ложь;
	
	Если ТипЗнч(СведенияОДатахЗапретаРедактирования) = Тип("Структура") Тогда
		ДатыЗапретаРедактирования = ПолучитьДатыЗапретаРедактирования(СведенияОДатахЗапретаРедактирования);		
	Иначе
		ДатыЗапретаРедактирования = СведенияОДатахЗапретаРедактирования;	
	КонецЕсли;
	
	Для Каждого ДатаЗапрета Из ДатыЗапретаРедактирования Цикл
		Если ДатаЗапрета.ДатаЗапретаРедактирования >= НачалоДня(Период) Тогда
			РезультатФункции = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УстановитьДатыЗапретаРедактирования(ДатыЗапретаРедактирования, Отбор, Комментарий = Неопределено) Экспорт
	
	Если Комментарий = Неопределено Тогда
		
		НовыеДатыЗапретаРедактирования = ДатыЗапретаРедактирования;	
		
	Иначе
		
		НовыеДатыЗапретаРедактирования = ДатыЗапретаРедактирования.Скопировать();
		
		Если НовыеДатыЗапретаРедактирования.Колонки.Найти("Комментарий") = Неопределено Тогда
			НовыеДатыЗапретаРедактирования.Колонки.Добавить("Комментарий", Метаданные.РегистрыСведений.ДатыЗапретаРедактирования.Реквизиты.Комментарий.Тип);
		КонецЕсли;
		
		НовыеДатыЗапретаРедактирования.ЗаполнитьЗначения(Комментарий, "Комментарий");			
		
	КонецЕсли;
	
	НаборЗаписейДатЗапретаРедактирования = СоздатьНаборЗаписейСОтбором(Отбор);
	НаборЗаписейДатЗапретаРедактирования.ДополнительныеСвойства.Вставить("НеПроверятьЗаполнениеДатыЗапрета");
	НаборЗаписейДатЗапретаРедактирования.ДополнительныеСвойства.Вставить("ИгнорироватьДатуЗапретаРедактированияКонтролера");
	НаборЗаписейДатЗапретаРедактирования.Загрузить(НовыеДатыЗапретаРедактирования);
	НаборЗаписейДатЗапретаРедактирования.Записать();
	
КонецПроцедуры

#КонецОбласти
